tap 'cloudfoundry/tap'
tap 'git-duet/tap'
tap 'heroku/brew'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/cask-versions'
tap 'minio/stable'
tap 'neovim/neovim'
tap 'pivotal-cf/om', 'https://github.com/pivotal-cf/om'
tap 'pivotal/tap'
tap 'universal-ctags/universal-ctags'
tap 'vmware-tanzu/carvel'
tap 'zegervdv/zathura'

brew 'ack'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash'
brew 'bbl'
brew 'bbr'
brew 'bitwarden-cli'
#brew 'bosh-cli'
brew 'cabal-install'
brew 'cf-cli@8'
brew 'chruby'
brew 'cmake'
brew 'coreutils'
brew 'credhub-cli'
brew 'csvkit'
brew 'direnv'
brew 'erlang'
brew 'fontconfig'
brew 'freetype'
brew 'fzf'
brew 'gcc' # required by sbt
brew 'gd'
brew 'gdbm'
brew 'gettext'
brew 'gh'
brew 'ghc'
brew 'git'
brew 'git-crypt'
brew 'git-duet'
brew 'go'
brew 'gradle'
brew 'graphviz'
brew 'gron'
brew 'helm'
brew 'heroku'
brew 'htop'
brew 'ipcalc'
brew 'java' unless system "/usr/libexec/java_home --failfast"
brew 'jemalloc'
brew 'jmeter'
brew 'jq'
brew 'jpeg'
brew 'kapp'
brew 'lastpass-cli'
brew 'leiningen'
brew 'libevent'
brew 'libpng'
brew 'libssh'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libuv'
brew 'libvterm'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'lua'
brew 'mas'
brew 'maven'
brew 'minio'
brew 'msgpack'
brew 'neovim'
brew 'nextcloud'
brew 'ngrep'
brew 'nmap'
brew 'node'
brew 'openldap'
brew 'om'
brew 'oniguruma'
brew 'openssl'
#brew 'pivnet-cli'
brew 'pmd'
brew 'postgresql'
brew 'python'
brew 'python-yq'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ripgrep'    # required by coc.nvim
brew 'ruby-install'
brew 's3cmd'
brew 'scala'
brew 'sbt'
brew 'telnet'
brew 'terraform'  # required by bbl
brew 'the_silver_searcher'
brew 'tig'
brew 'tmate'
brew 'tmux'
brew 'tree'
brew 'typescript'
brew 'universal-ctags', args: ['HEAD'] # requried by vim/tagbar
brew 'vault'
brew 'velero'
brew 'vim'
brew 'watch'
brew 'webp'
brew 'wget'
brew 'yarn' # required by coc.vim
brew 'ytt'
brew 'zsh'  # required by oh-my-zsh
brew 'zathura'  # required by coc-texlab
brew 'zathura-pdf-poppler'  # required by coc-texlab

cask 'adobe-acrobat-reader'
cask 'android-platform-tools'
cask 'android-studio'
cask 'caffeine'
cask 'coconutbattery'
cask 'cozy-drive'
cask 'deezer'
cask 'docker'
cask 'dropbox'
#cask 'firefox'
cask 'flux'
cask 'fly'
cask 'flycut'
#cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive-file-stream'
cask 'iterm2'
cask 'keybase'
cask 'libreoffice'
cask 'mactex' # required by texlab
cask 'ngrok'
cask 'no-ip-duc'
cask 'protonmail-bridge'
cask 'protonvpn'
cask 'signal'
#cask 'slack'
cask 'skim' # required by coc-texlab
cask 'skype'
cask 'spotify'
cask 'telegram-desktop'
cask 'thunderbird'
#cask 'tor-browser'
cask 'vagrant'
#cask 'virtualbox'
#cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'zoom'
cask 'whatsapp'

mas 'Xcode', id: 497799835
