tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'cloudfoundry/tap'
tap 'git-duet/tap'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/versions'
tap 'neovim/neovim'
tap 'starkandwayne/cf'
tap 'universal-ctags/universal-ctags'

brew 'ack'
brew 'ant'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash'
brew 'bosh-cli'
brew 'cf-cli'
brew 'chruby'
brew 'cmake'
brew 'coreutils'
brew 'ctags'
brew 'direnv'
brew 'docker'
brew 'erlang'
brew 'fontconfig'
brew 'freetype'
brew 'gd'
brew 'gdbm'
brew 'gettext'
brew 'git'
brew 'git-duet'
brew 'go'
brew 'graphviz'
brew 'htop'
brew 'ipcalc'
brew 'jemalloc'
brew 'jq'
brew 'jpeg'
brew 'lastpass-cli'
brew 'leiningen'
brew 'libevent'
brew 'libpng'
brew 'libssh'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libuv'
brew 'libvterm'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'lua'
brew 'oniguruma'
brew 'openssl'
brew 'webp'
brew 'wxmac'
brew 'python'
brew 'maven'
brew 'mr'
brew 'msgpack'
brew 'neovim'
brew 'ngrep'
brew 'nmap'
brew 'node'
brew 'python3'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ruby-install'
brew 's3cmd'
brew 'scala'
brew 'sbt'
brew 'shellcheck'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmate'
brew 'tmux'
brew 'tree'
brew 'universal-ctags', args: ['HEAD']
brew 'vim', args: ['with-lua']
brew 'watch'
brew 'wget'
brew 'zsh'  # required by oh-my-zsh

cask 'android-platform-tools'
cask 'atom'
cask 'caffeine'
cask 'coconutbattery'
cask 'docker'
cask 'dropbox'
cask 'encryptr'
cask 'firefox'
cask 'flux'
cask 'fly'
cask 'flycut'
cask 'font-inconsolata'
cask 'google-chrome'
cask 'hubic'
cask 'intellij-idea'
cask 'iterm2'
cask 'java'
cask 'keybase'
cask 'libreoffice'
cask 'prey'
cask 'shiftit'
cask 'skype'
cask 'spideroakone'
cask 'spotify'
cask 'torbrowser'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
